## Seleccion de Columnas

In [25]:
import pandas as pd
from tabulate import tabulate

def read_filepath(file):
    data = pd.read_csv(file,delimiter=';')
    return data

def tabulacion(data):
    out = print(tabulate(data,headers='keys',tablefmt='rounded_outline'))
    return out



df = filepath(r'C:\Users\User\OneDrive\Documentos\Archivos_Carlos\BBDD - No estructurada\Makro_Ventas.csv')
tabulacion(df.head(5))

╭────┬───────┬───────┬──────────┬────────────┬──────────┬────────────────┬──────────────────────┬─────────────┬──────────┬───────────────────┬──────────────────────────────────────────────────────┬────────────────┬─────────────────────┬──────────────────╮
│    │   Año │ Mes   │ Semana   │ Fechas     │ Cadena   │ Departamento   │ Distrito             │ Categoria   │ Marca    │   Codigo_Producto │ Material                                             │   Unidades B2B │   Peso en Toneladas │   Ventas sin IGV │
├────┼───────┼───────┼──────────┼────────────┼──────────┼────────────────┼──────────────────────┼─────────────┼──────────┼───────────────────┼──────────────────────────────────────────────────────┼────────────────┼─────────────────────┼──────────────────┤
│  0 │  2022 │ Abril │ Semana 1 │ 01/04/2022 │ Makro    │ Cusco          │ San Jeronimo (Cusco) │ Lejias      │ Sapolio  │           8300003 │ Lejia Sapolio Original 5000 grs 4Bot - 8300003       │             19 │            0.095    │           165.71 │
│  1 │  2022 │ Abril │ Semana 1 │ 01/04/2022 │ Makro    │ Cusco          │ San Jeronimo (Cusco) │ Pastas      │ Alianza  │           4300008 │ Fid.Alianza Codo Rayado 250 grs 20Bol - 4300008      │              2 │            0.0005   │             2.29 │
│  2 │  2022 │ Abril │ Semana 1 │ 01/04/2022 │ Makro    │ Cusco          │ San Jeronimo (Cusco) │ Aceites     │ Primor   │           3101013 │ Nu. Aceite Veg. Primor Premium 1 lt 12 Bot - 3101013 │             61 │            0.055876 │           603.9  │
│  3 │  2022 │ Abril │ Semana 1 │ 01/04/2022 │ Makro    │ Cusco          │ San Jeronimo (Cusco) │ Aceites     │ Primor   │           3101018 │ Aceite Prim Oliv Equilibrado 1 lt 12Botpet - 3101018 │              1 │            0.000916 │            29.57 │
│  4 │  2022 │ Abril │ Semana 1 │ 01/04/2022 │ Makro    │ Cusco          │ San Jeronimo (Cusco) │ Detergentes │ Marsella │           8400550 │ Det Marsella Alegria Trop 750Gr.15Bol - 8400550      │              1 │            0.00075  │             6.78 │
╰────┴───────┴───────┴──────────┴────────────┴──────────┴────────────────┴──────────────────────┴─────────────┴──────────┴───────────────────┴──────────────────────────────────────────────────────┴────────────────┴─────────────────────┴──────────────────╯

,Año,Codigo_Producto,Unidades B2B,Peso en Toneladas,Ventas sin IGV
count,625434.0,6.254340e+05,625434.000000,625434.000000,625434.000000
mean,2022.0,6.239709e+06,19.575274,0.013786,98.718511
std,0.0,2.231376e+06,84.309577,0.046964,274.907435
min,2022.0,3.508000e+03,0.000000,0.000000,-26.150000
25%,2022.0,4.305035e+06,2.000000,0.000985,13.080000
50%,2022.0,6.701003e+06,5.000000,0.002860,30.255000
75%,2022.0,8.320032e+06,16.000000,0.009180,77.330000
max,2022.0,9.550026e+06,32160.000000,3.591750,57233.900000

In [5]:
df.columns

Index(['Año', 'Mes', 'Semana', 'Fechas', 'Cadena', 'Departamento', 'Distrito',
       'Categoria', 'Marca', 'Codigo_Producto', 'Material', 'Unidades B2B',
       'Peso en Toneladas', 'Ventas sin IGV'],
      dtype='object')

In [26]:
## Ejercicio 1
## Se pide mostrar un top 5 de las mayores ventas que se te tuvieron en la base correspondiente

eje1 = df[['Año','Mes','Semana','Material','Ventas sin IGV']].sort_values(by='Ventas sin IGV',ascending=False).head(5)
tabulacion(eje1)

╭────────┬───────┬─────────┬──────────┬──────────────────────────────────────────────────────┬──────────────────╮
│        │   Año │ Mes     │ Semana   │ Material                                             │   Ventas sin IGV │
├────────┼───────┼─────────┼──────────┼──────────────────────────────────────────────────────┼──────────────────┤
│ 246638 │  2022 │ Febrero │ Semana 4 │ Uchucuta Alacena 85 grs24Dpk Wa - 3300110            │          57233.9 │
│ 120558 │  2022 │ Enero   │ Semana 3 │ Nu. Aceite Veg. Primor Premium 1 lt 12 Bot - 3101013 │          24526.6 │
│ 619203 │  2022 │ Julio   │ Semana 4 │ Nu.Fid.Don Vittorio Cab.Ang.250 grs 40Bol - 4302043  │          19913.1 │
│ 244401 │  2022 │ Febrero │ Semana 4 │ Uchucuta Alacena 85 grs24Dpk Wa - 3300110            │          19134.9 │
│ 226624 │  2022 │ Febrero │ Semana 4 │ Nu.Fid.Don Vittorio Lingüi.500 grs 20Bol - 4302041   │          15819.9 │
╰────────┴───────┴─────────┴──────────┴──────────────────────────────────────────────────────┴──────────────────╯

In [61]:
## Ejercicio 2

## Se solicita obtener unicamente atributos 'Mes' y unidades peso en toneladas ventas sin IGV se solicita en una nueva variable el ejercicio se debe de resolver de 2 formas posibles
## Forma 1

atributos = ['Mes','Unidades B2B','Peso en Toneladas','Ventas sin IGV']
df2 = df[atributos].sort_values(by='Ventas sin IGV',ascending= False )
df2.head(5)

            Mes  Unidades B2B  Peso en Toneladas  Ventas sin IGV
246638  Febrero         32160           2.733600        57233.90
120558    Enero          2634           2.412744        24526.61
619203    Julio         14367           3.591750        19913.06
244401  Febrero         10752           0.913920        19134.91
226624  Febrero          6458           3.229000        15819.93

In [12]:
## Resolucion ejercicio 2 _ Forma 2

atributos_1 = df[['Mes','Unidades B2B','Peso en Toneladas','Ventas sin IGV']]
atributos_1.head(5)

     Mes  Unidades B2B  Peso en Toneladas  Ventas sin IGV
0  Abril            19           0.095000          165.71
1  Abril             2           0.000500            2.29
2  Abril            61           0.055876          603.90
3  Abril             1           0.000916           29.57
4  Abril             1           0.000750            6.78

In [47]:
## Ejercicio 1 -- Libreria tabulate

# Seleccionar solo las columnas 'Año', 'Mes', 'Semana' y 'Fechas'
data = df[['Año', 'Mes', 'Semana', 'Fechas']].values.tolist() ## Se pasa a valores de lista

# Seleccionar solo los primeros 5 elementos de la lista
data_2 = data[:10] ## Se realiza este codigo ya que la variable data se encuentra como formato lista

# Imprimir la lista en una tabla
print(tabulate(data_2, headers=['Año', 'Mes', 'Semana', 'Fechas'],tablefmt='psql'))

+-------+-------+----------+------------+
|   Año | Mes   | Semana   | Fechas     |
|-------+-------+----------+------------|
|  2022 | Abril | Semana 1 | 01/04/2022 |
|  2022 | Abril | Semana 1 | 01/04/2022 |
|  2022 | Abril | Semana 1 | 01/04/2022 |
|  2022 | Abril | Semana 1 | 01/04/2022 |
|  2022 | Abril | Semana 1 | 01/04/2022 |
|  2022 | Abril | Semana 1 | 01/04/2022 |
|  2022 | Abril | Semana 1 | 01/04/2022 |
|  2022 | Abril | Semana 1 | 01/04/2022 |
|  2022 | Abril | Semana 1 | 01/04/2022 |
|  2022 | Abril | Semana 1 | 01/04/2022 |
+-------+-------+----------+------------+

In [59]:
# Ejercicio 2 -- Libreria tabulate
# Se solicita mostrar en el formato tabulate los registros resueltos del ejercicio numero 2 y se pide mostrar unicamente 5 registros

df3 = df[atributos].values.tolist() ## Pasa a lista el nuevo data frame
data_3 = df3[:6]
print(tabulate(data_3,headers=atributos,tablefmt = 'psql'))

+-------+----------------+---------------------+------------------+
| Mes   |   Unidades B2B |   Peso en Toneladas |   Ventas sin IGV |
|-------+----------------+---------------------+------------------|
| Abril |             19 |            0.095    |           165.71 |
| Abril |              2 |            0.0005   |             2.29 |
| Abril |             61 |            0.055876 |           603.9  |
| Abril |              1 |            0.000916 |            29.57 |
| Abril |              1 |            0.00075  |             6.78 |
| Abril |              5 |            0.0025   |            13.15 |
+-------+----------------+---------------------+------------------+

In [1]:
# Ejercicio 3 -- Libreria tabulate

# Se solicita mostrar en el formato tabulate unicamente de los atributos año , categoria , ventas sin IGV y toneladas en una variable se solicta mostrar unimcanete 15 registros en utilizando la libreria tabulate
new_dataset = ['Año','Categoria','Ventas sin IGV','Peso en Toneladas'] ## Se crea una variable para llamar los atributos solicitados
new_df = df[new_dataset].values.tolist() ## Se realiza la conversion a lista para que se pueda utilizar la libreria tabulate
filtro_15 = new_df[:15] ## Se realiza el filtro correspondiente para que se muestre unicamente los 15 registros
print(tabulate(filtro_15,headers=new_dataset,tablefmt='psql')) ## Se imprime el resultado final

NameError: name 'df' is not defined

In [15]:
import pandas as pd

data = {'Nombre': ['Juan', 'Maria', 'Pedro', 'Juan', 'Luis', 'Maria','Carlos','Carlos'],
        'Edad': [20, 25, 30, 20, 40, 25,25,25],
        'Ciudad': ['Madrid', 'Barcelona', 'Valencia', 'Madrid', 'Sevilla', 'Barcelona','Peru','Peru']}

In [16]:
df_ = pd.DataFrame(data)
df_

   Nombre  Edad     Ciudad
0    Juan    20     Madrid
1   Maria    25  Barcelona
2   Pedro    30   Valencia
3    Juan    20     Madrid
4    Luis    40    Sevilla
5   Maria    25  Barcelona
6  Carlos    25       Peru
7  Carlos    25       Peru